<?php
/**
 * Created by PhpStorm.
 * User: tyt
 * Date: 2018/10/20
 * Time: 14:22
 */

return [
    '-1'		            =>      '网络异常',
    '0'		                =>      'success',

    
    '100'                   =>      '',//验证器类返回错误
    '101'                   =>      '',//自定义返回

    '1000'                  =>      '数据库插入异常',//1000-1999为数据库出错
    '1001'                  =>      '参数错误',
    '1002'                  =>      '数据库更新异常-未修改',//前端未验证数据是否修改，将未修改数据提交到了后端
    '1003'                  =>      '数据库删除异常',


    '200'                   =>      '账号或密码错误',
    '400'                   =>      '参数错误',//validate,自定义
    '500'                   =>      '数据库操作失败',
    '600'                   =>      '数据已存在',
    '601'                   =>      '数据不存在',
    '10001'		            =>      '师傅代码错误',
    '10002'		            =>      '邀请注册已达上限',
    '10003'		            =>      '今日邀请注册已达上限',
    '10004'		            =>      '邀请人不存在',
    '10005'		            =>      'QQ已存在',
    '10006'		            =>      '微信已存在',
    '10007'		            =>      '旺旺已存在',
    '10008'		            =>      '手机号已存在',
    '10009'		            =>      '用户名已存在',
    '10010'		            =>      '支付宝已存在',
    '10011'		            =>      '邀请码错误',
    '10012'		            =>      '该账户还未通过师傅审核',
    '10013'		            =>      '该账户还未通过操作员审核',
    '10014'		            =>      '该账户已被冻结',
    '10015'		            =>      '您已绑定',
    '10016'                 =>      '您有一个宣速同城快递任务单待五星好评,请五分不带字好评后,再申请任务!',
    '10017'                 =>      '三天内已做过任务，请明天再试',
    '10018'                 =>      '本日取消次数已超过3次，请明天再试',
    '10019'                 =>      '暂时没有任务',



];